# num1 = int(input("Ведіть число  "))
# print(f"{num1} в 1 степені: {num1 ** 1}")
# print(f"{num1} в 2 степені: {num1 ** 2}")
# print(f"{num1} в 3 степені: {num1 ** 3}")
# print(f"{num1} в 4 степені: {num1 ** 4}")
# print(f"{num1} в 5 степені: {num1 ** 5}")
# print(f"{num1} в 6 степені: {num1 ** 6}")
# print(f"{num1} в 7 степені: {num1 ** 7}")



# num1 = int(input("Ведіть число від 1 до 100: "))
# if num1 < 1 or num1 > 100:
#     print("Некоректне число")
# elif num1 % 3 == 0 and num1 % 5 == 0:
#     print("Fizz Buzz")
# elif num1 % 3 == 0:
#     print("Fizz")
# elif num1 % 5 == 0:
#     print("Buzz")
# else:
#     print(num1)



num1 = str(input("Виберіть закуску( Салат - 5$,Суп - 7$, Нічого.): "))
num2 = str(input("Виберіть основну страву(Курка - 10$, Риба - 12$, Нічого.): "))
num3 = str(input("Виберіть десерт(Морозиво - 3$,Фрукти - 4$, Нічого): "))
num4 = int(input("Ведіть кількість ваших відвідувань нашого ресторану: "))

if num1 == "Салат" and num2 == "Курка" and num3 =="Морозиво" and num4 < 15:
    print(f"Ціна за все замовлення {18 - (18 * 10 / 100) }$ \n Також вам додається до замовлення безкоштовний чай.")
elif num1 == "Салат" and num2 == "Курка" and num3 =="Морозиво" and num4 > 15:
    print(f"Ціна за все замовлення {18 - (18 * 15 / 100) }$ \n Також вам додається до замовлення безкоштовний чай.")


elif num1 == "Салат" and num2 == "Курка" and num3 ==  "Фрукти" and num4 < 15:
    print(f"Ціна за все замовлення {18 - (18 * 10 / 100) }$")
elif num1 == "Салат" and num2 == "Курка" and num3 ==  "Фрукти" and num4 > 15:
    print(f"Ціна за все замовлення {18 - (18 * 10 / 100) }$")



elif num1 == "Салат" and num2 == "Риба" and num3 == "Морозиво" and num4 < 15:
    print(f"Ціна за все замовлення {18 - (18 * 15 / 100) }$")
elif num1 == "Салат" and num2 == "Риба" and num3 == "Морозиво" and num4 > 15:
    print(f"Ціна за все замовлення {18 - (18 * 20 / 100) }$") 



elif num1 == "Салат" and num2 == "Риба" and num3 == "Фрукти" and num4 < 15:
    print(f"Ціна за все замовлення {18 - (18 * 15 / 100) }$")
elif num1 == "Салат" and num2 == "Риба" and num3 == "Фрукти" and num4 > 15:
    print(f"Ціна за все замовлення {18 - (18 * 20 / 100) }$")



elif num1 == "Суп" and num2 == "Курка" and num3 == "Морозиво" and num4 < 15:
    print(f"Ціна за все замовлення {18 - (18 * 15 / 100) }$ \n Також вам додається до замовлення безкоштовний чай.")
elif num1 == "Суп" and num2 == "Курка" and num3 == "Морозиво" and num4 > 15:
    print(f"Ціна за все замовлення {18 - (18 * 20 / 100) }$ \n Також вам додається до замовлення безкоштовний чай.")




elif num1 == "Суп" and num2 == "Курка" and num3 == "Фрукти" and num4 < 15: 
    print(f"Ціна за все замовлення {18 - (18 * 15 / 100) }$")
elif num1 == "Суп" and num2 == "Курка" and num3 == "Фрукти" and num4 > 15: 
    print(f"Ціна за все замовлення {18 - (18 * 20 / 100) }$")




elif num1 == "Суп" and num2 == "Риба" and num3 ==  "Морозиво" and num4 < 15:
    print(f"Ціна за все замовлення {18 - (18 * 17 / 100) }$")
elif num1 == "Суп" and num2 == "Риба" and num3 ==  "Морозиво" and num4 > 15:
    print(f"Ціна за все замовлення {18 - (18 * 22 / 100) }$")




elif num1 == "Суп" and num2 == "Риба" and num3 == "Фрукти" and num4 < 15:
    print(f"Ціна за все замовлення {18 - (18 * 17 / 100) }$.")
elif num1 == "Суп" and num2 == "Риба" and num3 == "Фрукти" and num4 > 15:
    print(f"Ціна за все замовлення {18 - (18 * 22 / 100) }$.")




elif num1 == "Салат" and num2 == "Курка" and num3 == "Нічого" and num4 < 15:
    print("Ціна за все замовлення 15$")
elif num1 == "Салат" and num2 == "Курка" and num3 == "Нічого" and num4 > 15:
    print(f"Ціна за все замовлення {15 - 15 * 5 / 100}$")




elif num1 == "Салат" and num2 == "Риба" and num3 == "Нічого" and num4 < 15:
    print("Ціна за все замовлення 17$")
elif num1 == "Салат" and num2 == "Риба" and num3 == "Нічого" and num4 > 15:
    print(f"Ціна за все замовлення {17 - 17 * 5 / 100}$")



elif num1 == "Суп" and num2 == "Курка" and num3 == "Нічого" and num4 < 15:
    print("Ціна за все замовлення 17$")
elif num1 == "Суп" and num2 == "Курка" and num3 == "Нічого" and num4 > 15:
    print(f"Ціна за все замовлення {17 - 17 * 5 / 100}$")




elif num1 == "Суп" and num2 == "Риба" and num3 == "Нічого" and num4 < 15:
    print("Ціна за все замовлення 19$")
elif num1 == "Суп" and num2 == "Риба" and num3 == "Нічого" and num4 > 15:
    print(f"Ціна за все замовлення {19 - 19 * 5 / 100}$")




    
elif num1 == "Салат" and num2 == "Нічого" and num3 == "Морозиво" and num4 < 15:
    print("Ціна за все замовлення 8$")
elif num1 == "Салат" and num2 == "Нічого" and num3 == "Морозиво" and num4 > 15:
    print(f"Ціна за все замовлення {8 - 8 * 5 / 100}")




elif num1 == "Салат" and num2 == "Нічого" and num3 == "Фрукти" and num4 < 15:
    print("Ціна за все замовлення 9$")
elif num1 == "Салат" and num2 == "Нічого" and num3 == "Фрукти" and num4 > 15:
    print(f"Ціна за все замовлення {9 - 9 * 5 / 100}$")





elif num1 == "Суп" and num2 == "Нічого" and num3 == "Морозиво" and num4 < 15:
    print("Ціна за все замовлення 10$")
elif num1 == "Суп" and num2 == "Нічого" and num3 == "Морозиво" and num4 > 15:
    print(f"Ціна за все замовлення {10 - 10 * 5 / 100}$")




elif num1 == "Суп" and num2 == "Нічого" and num3 == "Фрукти" and num4 < 15:
    print("Ціна за все замовлення 11$")
elif num1 == "Суп" and num2 == "Нічого" and num3 == "Фрукти" and num4 > 15:
    print(f"Ціна за все замовлення {11 - 11 * 5 / 100}$")




elif num1 == "Нічого" and num2 == "Курка" and num3 == "Морозиво" and num4 < 15:
    print("Ціна за все замовлення 13$ \n Також вам додається до замовлення безкоштовний чай.")
elif num1 == "Нічого" and num2 == "Курка" and num3 == "Морозиво" and num4 > 15:
    print(f"Ціна за все замовлення {13 - 13 *5 / 100}$ \n Також вам додається до замовлення безкоштовний чай.")





elif num1 == "Нічого" and num2 == "Курка" and num3 == "Фрукти" and num4 < 15:
    print("Ціна за все замовлення 14$")
elif num1 == "Нічого" and num2 == "Курка" and num3 == "Фрукти" and num4 > 15:
    print(f"Ціна за все замовлення {14 - 14 * 5 / 100}$")



elif num1 == "Нічого" and num2 == "Риба" and num3 == "Морозиво" and num4 < 15:
    print("Ціна за все замовлення 15$")
elif num1 == "Нічого" and num2 == "Риба" and num3 == "Морозиво" and num4 > 15:
    print(f"Ціна за все замовлення {15 - 15 * 5 / 100}$")



elif num1 == "Нічого" and num2 == "Риба" and num3 == "Фрукти" and num4 < 15:
    print("Ціна за все замовлення 16$")
elif num1 == "Нічого" and num2 == "Риба" and num3 == "Фрукти" and num4 > 15:
    print(f"Ціна за все замовлення {16 - 16 * 5 / 100}$")



elif num1 == "Салат" and num2 == "Нічого" and num3 == "Нічого" and num4 < 15:
    print("Ціна за все замовлення 5$")
elif num1 == "Салат" and num2 == "Нічого" and num3 == "Нічого" and num4 > 15:
    print(f"Ціна за все замовлення {5 - 5 * 5 / 100}$")



elif num1 == "Суп" and num2 == "Нічого" and num3 == "Нічого" and num4 < 15:
    print("Ціна за все замовлення 7$")
elif num1 == "Суп" and num2 == "Нічого" and num3 == "Нічого" and num4 > 15:
    print(f"Ціна за все замовлення {7 - 7 * 5 / 100}$")



elif num1 == "Нічого" and num2 == "Курка" and num3 == "Нічого" and num4 < 15:
    print("Ціна за все замовлення 10$")
elif num1 == "Нічого" and num2 == "Курка" and num3 == "Нічого" and num4 > 15:
    print(f"Ціна за все замовлення {10 - 10 * 5 / 100}$")



elif num1 == "Нічого" and num2 == "Риба" and num3 == "Нічого" and num4 < 15:
    print("Ціна за все замовлення 12$")
elif num1 == "Нічого" and num2 == "Риба" and num3 == "Нічого" and num4 > 15:
    print(f"Ціна за все замовлення {12 - 12 * 5 / 100}$")




elif num1 == "Нічого" and num2 == "Нічого" and num3 == "Морозиво" and num4 < 15:
    print("Ціна за все замовлення 3$")
elif num1 == "Нічого" and num2 == "Нічого" and num3 == "Морозиво" and num4 > 15:
    print(f"Ціна за все замовлення {3 - 3 * 5 / 100}$")



elif num1 == "Нічого" and num2 == "Нічого" and num3 == "Фрукти" and num4 < 15:
    print("Ціна за все замовлення 4$")
elif num1 == "Нічого" and num2 == "Нічого" and num3 == "Фрукти" and num4 > 15:
    print("Ціна за все замовлення {4 - 4 * 5 / 100}$")








